ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR64DD28def.inc
; ADC_SAMPCTRL masks
.equ ADC_SAMPLEN_gm = 0xFF               ; Sample lenght group mask
.equ ADC_SAMPLEN_gp = 0                  ; Sample lenght group position
.equ ADC_SAMPLEN_0_bm = (1<<0)           ; Sample lenght bit 0 mask
.equ ADC_SAMPLEN_0_bp = 0                ; Sample lenght bit 0 position
.equ ADC_SAMPLEN_1_bm = (1<<1)           ; Sample lenght bit 1 mask
.equ ADC_SAMPLEN_1_bp = 1                ; Sample lenght bit 1 position
.equ ADC_SAMPLEN_2_bm = (1<<2)           ; Sample lenght bit 2 mask
.equ ADC_SAMPLEN_2_bp = 2                ; Sample lenght bit 2 position
.equ ADC_SAMPLEN_3_bm = (1<<3)           ; Sample lenght bit 3 mask
.equ ADC_SAMPLEN_3_bp = 3                ; Sample lenght bit 3 position
.equ ADC_SAMPLEN_4_bm = (1<<4)           ; Sample lenght bit 4 mask
.equ ADC_SAMPLEN_4_bp = 4                ; Sample lenght bit 4 position
.equ ADC_SAMPLEN_5_bm = (1<<5)           ; Sample lenght bit 5 mask
.equ ADC_SAMPLEN_5_bp = 5                ; Sample lenght bit 5 position
.equ ADC_SAMPLEN_6_bm = (1<<6)           ; Sample lenght bit 6 mask
.equ ADC_SAMPLEN_6_bp = 6                ; Sample lenght bit 6 position
.equ ADC_SAMPLEN_7_bm = (1<<7)           ; Sample lenght bit 7 mask
.equ ADC_SAMPLEN_7_bp = 7                ; Sample lenght bit 7 position

; ADC_MUXPOS masks
.equ ADC_MUXPOS_gm = 0x7F                ; Analog Channel Selection Bits group mask
.equ ADC_MUXPOS_gp = 0                   ; Analog Channel Selection Bits group position
.equ ADC_MUXPOS_0_bm = (1<<0)            ; Analog Channel Selection Bits bit 0 mask
.equ ADC_MUXPOS_0_bp = 0                 ; Analog Channel Selection Bits bit 0 position
.equ ADC_MUXPOS_1_bm = (1<<1)            ; Analog Channel Selection Bits bit 1 mask
.equ ADC_MUXPOS_1_bp = 1                 ; Analog Channel Selection Bits bit 1 position
.equ ADC_MUXPOS_2_bm = (1<<2)            ; Analog Channel Selection Bits bit 2 mask
.equ ADC_MUXPOS_2_bp = 2                 ; Analog Channel Selection Bits bit 2 position
.equ ADC_MUXPOS_3_bm = (1<<3)            ; Analog Channel Selection Bits bit 3 mask
.equ ADC_MUXPOS_3_bp = 3                 ; Analog Channel Selection Bits bit 3 position
.equ ADC_MUXPOS_4_bm = (1<<4)            ; Analog Channel Selection Bits bit 4 mask
.equ ADC_MUXPOS_4_bp = 4                 ; Analog Channel Selection Bits bit 4 position
.equ ADC_MUXPOS_5_bm = (1<<5)            ; Analog Channel Selection Bits bit 5 mask
.equ ADC_MUXPOS_5_bp = 5                 ; Analog Channel Selection Bits bit 5 position
.equ ADC_MUXPOS_6_bm = (1<<6)            ; Analog Channel Selection Bits bit 6 mask
.equ ADC_MUXPOS_6_bp = 6                 ; Analog Channel Selection Bits bit 6 position

; ADC_MUXNEG masks
.equ ADC_MUXNEG_gm = 0x7F                ; Analog Channel Selection Bits group mask
.equ ADC_MUXNEG_gp = 0                   ; Analog Channel Selection Bits group position
.equ ADC_MUXNEG_0_bm = (1<<0)            ; Analog Channel Selection Bits bit 0 mask
.equ ADC_MUXNEG_0_bp = 0                 ; Analog Channel Selection Bits bit 0 position
.equ ADC_MUXNEG_1_bm = (1<<1)            ; Analog Channel Selection Bits bit 1 mask
.equ ADC_MUXNEG_1_bp = 1                 ; Analog Channel Selection Bits bit 1 position
.equ ADC_MUXNEG_2_bm = (1<<2)            ; Analog Channel Selection Bits bit 2 mask
.equ ADC_MUXNEG_2_bp = 2                 ; Analog Channel Selection Bits bit 2 position
.equ ADC_MUXNEG_3_bm = (1<<3)            ; Analog Channel Selection Bits bit 3 mask
.equ ADC_MUXNEG_3_bp = 3                 ; Analog Channel Selection Bits bit 3 position
.equ ADC_MUXNEG_4_bm = (1<<4)            ; Analog Channel Selection Bits bit 4 mask
.equ ADC_MUXNEG_4_bp = 4                 ; Analog Channel Selection Bits bit 4 position
.equ ADC_MUXNEG_5_bm = (1<<5)            ; Analog Channel Selection Bits bit 5 mask
.equ ADC_MUXNEG_5_bp = 5                 ; Analog Channel Selection Bits bit 5 position
.equ ADC_MUXNEG_6_bm = (1<<6)            ; Analog Channel Selection Bits bit 6 mask
.equ ADC_MUXNEG_6_bp = 6                 ; Analog Channel Selection Bits bit 6 position

; ADC_COMMAND masks
.equ ADC_STCONV_bm = 0x01                ; Start Conversion bit mask
.equ ADC_STCONV_bp = 0                   ; Start Conversion bit position
.equ ADC_SPCONV_bm = 0x02                ; Stop Conversion bit mask
.equ ADC_SPCONV_bp = 1                   ; Stop Conversion bit position

; ADC_EVCTRL masks
.equ ADC_STARTEI_bm = 0x01               ; Start Event Input Enable bit mask
.equ ADC_STARTEI_bp = 0                  ; Start Event Input Enable bit position

; ADC_INTCTRL masks
.equ ADC_RESRDY_bm = 0x01                ; Result Ready Interrupt Enable bit mask
.equ ADC_RESRDY_bp = 0                   ; Result Ready Interrupt Enable bit position
.equ ADC_WCMP_bm = 0x02                  ; Window Comparator Interrupt Enable bit mask
.equ ADC_WCMP_bp = 1                     ; Window Comparator Interrupt Enable bit position

; ADC_INTFLAGS masks
; Masks for ADC_RESRDY already defined
; Masks for ADC_WCMP already defined

; ADC_DBGCTRL masks
.equ ADC_DBGRUN_bm = 0x01                ; Debug run bit mask
.equ ADC_DBGRUN_bp = 0                   ; Debug run bit position

; ADC_TEMP masks
.equ ADC_TEMP_gm = 0xFF                  ; Temporary group mask
.equ ADC_TEMP_gp = 0                     ; Temporary group position
.equ ADC_TEMP_0_bm = (1<<0)              ; Temporary bit 0 mask
.equ ADC_TEMP_0_bp = 0                   ; Temporary bit 0 position
.equ ADC_TEMP_1_bm = (1<<1)              ; Temporary bit 1 mask
.equ ADC_TEMP_1_bp = 1                   ; Temporary bit 1 position
.equ ADC_TEMP_2_bm = (1<<2)              ; Temporary bit 2 mask
.equ ADC_TEMP_2_bp = 2                   ; Temporary bit 2 position
.equ ADC_TEMP_3_bm = (1<<3)              ; Temporary bit 3 mask
.equ ADC_TEMP_3_bp = 3                   ; Temporary bit 3 position
.equ ADC_TEMP_4_bm = (1<<4)              ; Temporary bit 4 mask
.equ ADC_TEMP_4_bp = 4                   ; Temporary bit 4 position
.equ ADC_TEMP_5_bm = (1<<5)              ; Temporary bit 5 mask
.equ ADC_TEMP_5_bp = 5                   ; Temporary bit 5 position
.equ ADC_TEMP_6_bm = (1<<6)              ; Temporary bit 6 mask
.equ ADC_TEMP_6_bp = 6                   ; Temporary bit 6 position
.equ ADC_TEMP_7_bm = (1<<7)              ; Temporary bit 7 mask
.equ ADC_TEMP_7_bp = 7                   ; Temporary bit 7 position

; Conversion mode select
.equ ADC_CONVMODE_SINGLEENDED_gc = (0x00<<5) ; Single-Ended mode
.equ ADC_CONVMODE_DIFF_gc = (0x01<<5)    ; Differential mode

